In [1]:
my_dict = {
    "fname": ["John",'jane','jones'],
    "lname": ["Zena",'mira','jonathan'],
    "age": [30,45,32],
    "is_student": [False,False,False],
    "grades": [90, 85, 88]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(my_dict)

In [4]:
df

   fname     lname  age  is_student  grades
0   John      Zena   30       False      90
1   jane      mira   45       False      85
2  jones  jonathan   32       False      88

In [5]:
df['fname'] + '  ' + df['lname']

0         John  Zena
1         jane  mira
2    jones  jonathan
dtype: object

In [6]:
df['full name'] = df['fname'] + ' ' + df['lname']
df

   fname     lname  age  is_student  grades       full name
0   John      Zena   30       False      90       John Zena
1   jane      mira   45       False      85       jane mira
2  jones  jonathan   32       False      88  jones jonathan

In [7]:
df.drop(columns=['fname', 'lname'], inplace=True)

In [8]:
df

   age  is_student  grades       full name
0   30       False      90       John Zena
1   45       False      85       jane mira
2   32       False      88  jones jonathan

In [9]:
df['full name'].str.split(' ', expand=True)

       0         1
0   John      Zena
1   jane      mira
2  jones  jonathan

In [10]:
df[['first','last']] = df['full name'].str.split(' ', expand=True)

In [11]:
df

   age  is_student  grades       full name  first      last
0   30       False      90       John Zena   John      Zena
1   45       False      85       jane mira   jane      mira
2   32       False      88  jones jonathan  jones  jonathan

In [12]:
df = pd.concat([df, pd.DataFrame({'first': ['Tony']})], ignore_index=True)

In [13]:
df

    age is_student  grades       full name  first      last
0  30.0      False    90.0       John Zena   John      Zena
1  45.0      False    85.0       jane mira   jane      mira
2  32.0      False    88.0  jones jonathan  jones  jonathan
3   NaN        NaN     NaN             NaN   Tony       NaN

In [14]:
my_dict = {
    "fname": ["John",'jane'],
    "lname": ["Zena",'mira'],
    "age": [30,45],
    "is_student": [False,False],
    "grades": [90, 85]
}
df2 = pd.DataFrame(my_dict)

In [15]:
df2

  fname lname  age  is_student  grades
0  John  Zena   30       False      90
1  jane  mira   45       False      85

In [16]:
df = pd.concat([df,df2], ignore_index=True)

In [17]:
df

    age is_student  grades       full name  first      last fname lname
0  30.0      False    90.0       John Zena   John      Zena   NaN   NaN
1  45.0      False    85.0       jane mira   jane      mira   NaN   NaN
2  32.0      False    88.0  jones jonathan  jones  jonathan   NaN   NaN
3   NaN        NaN     NaN             NaN   Tony       NaN   NaN   NaN
4  30.0      False    90.0             NaN    NaN       NaN  John  Zena
5  45.0      False    85.0             NaN    NaN       NaN  jane  mira